Repository: an90ass/Vakit
Catalog: lib/l10n/app_*.arb
Languages: ar, tr

# appTitle
source: Vakit
ar: وقت

# homeGreeting
source: Welcome
ar: مرحبًا
tr: Hoş geldin

# homeGreetingSubtitle
source: Wishing you a peaceful day
ar: نتمنى لك يومًا هادئًا
tr: Huzurlu bir gün dileriz

# tabHome
source: Home
ar: الرئيسية
tr: Ana Sayfa

# tabCities
source: Cities
ar: المدن
tr: Şehirler

# tabMyPrayers
source: My Prayers
ar: صلواتي
tr: Namazlarım

# tabQuran
source: Quran
ar: القرآن
tr: Kuran

# tabSettings
source: Settings
ar: الإعدادات
tr: Ayarlar

# locationLoading
source: Fetching your location...
ar: جارٍ جلب الموقع...
tr: Konum alınıyor...

source: Location error
ar: خطأ في الموقع
tr: Konum hatası

# genericError
source: Something went wrong
ar: حدث خطأ ما
tr: Bir şeyler ters gitti

# nextPrayerLabel
source: Next prayer
ar: الصلاة القادمة
tr: Bir sonraki namaz

# remainingLabel
source: remaining
ar: متبقي
tr: kaldı

# locationsHeader
source: Tracked locations
ar: المواقع المتابعة
tr: Takip edilen konumlar

# locationsSubhead
source: Track up to 3 places and view them side by side.
ar: تابع حتى ٣ أماكن وشاهدها معًا.
tr: 3 konuma kadar ekleyebilir ve hepsini aynı anda görebilirsin.

source: Add location
ar: أضف موقعًا
tr: Konum ekle

source: Current Location
ar: الموقع الحالي
tr: Mevcut Konum

source: Manual Location
ar: موقع يدوي
tr: Manuel Konum

# maxLocationsReached
source: You can store up to {count} locations.
ar: يمكنك حفظ ما يصل إلى {count} مواقع.
tr: En fazla {count} konum kaydedebilirsin.

# addLocationTitle
source: Add a new location
ar: إضافة موقع جديد
tr: Yeni konum ekle

# addLocationDescription
source: Type a city, district, or full address to add it to your list.
ar: اكتب مدينة أو عنوانًا كاملاً لإضافته.
tr: Şehir, ilçe veya tam adres girerek konum ekleyebilirsin.

# addressFieldLabel
source: Address or city
ar: العنوان أو المدينة
tr: Adres veya şehir

# addressFieldHint
source: e.g. Adana Seyhan
ar: مثال: أضنة سيهان
tr: Örn. Adana Seyhan

# labelFieldLabel
source: Card label (optional)
ar: اسم البطاقة (اختياري)
tr: Kart adı (isteğe bağlı)

source: Cancel
ar: إلغاء
tr: İptal

source: Save
ar: حفظ
tr: Kaydet

source: Set active
ar: اجعله نشطًا
tr: Aktif yap

source: Active
ar: نشط
tr: Aktif

source: Delete
ar: حذف
tr: Sil

source: Location saved.
ar: تم حفظ الموقع.
tr: Konum kaydedildi.

# locationDeleted
source: Location removed.
ar: تم حذف الموقع.
tr: Konum silindi.

# locationSearchFailed
source: We couldn't find that address. Please try something else.
ar: تعذر إيجاد العنوان. جرّب عبارة مختلفة.
tr: Adres bulunamadı. Lütfen farklı bir ifade deneyin.

# languageTitle
source: App Language
ar: لغة التطبيق
tr: Uygulama Dili

# languageSubtitle
source: Switch between Turkish, English, and Arabic.
ar: بدّل بين التركية والإنجليزية والعربية.
tr: Türkçe, İngilizce ve Arapça arasında geçiş yap.

# languageTurkish
source: Turkish
ar: التركية
tr: Türkçe

# languageEnglish
source: English
ar: الإنجليزية
tr: İngilizce

# languageArabic
source: Arabic
ar: العربية
tr: Arapça

# languageChanged
source: Language updated.
ar: تم تحديث اللغة.
tr: Dil güncellendi.

# citiesScreenTitle
source: City dashboard
ar: لوحة المدن
tr: Şehir paneli

# citiesRefreshAction
source: Refresh prayer summaries
ar: تحديث ملخصات الصلوات
tr: Namaz özetlerini yenile

# citiesDeleteConfirm
source: Remove this city from your list?
ar: هل تريد إزالة هذه المدينة من قائمتك؟
tr: Bu şehri listeden kaldırmak istiyor musun?

# citiesCardSubtitle
source: Stay updated with this city's next prayer.
ar: تابع الصلاة القادمة لهذه المدينة.
tr: Bu konuma ait sonraki namazı takip et.

# citiesEmptyTitle
source: No cities yet
ar: لا توجد مدن بعد
tr: Henüz şehir yok

# citiesEmptyDescription
source: Add a manual city or refresh GPS to start tracking.
ar: أضف مدينة يدويًا أو حدّث GPS للبدء.
tr: Manuel şehir ekleyerek veya GPS'i yenileyerek başlayabilirsin.

# citiesManageButton
source: Open city dashboard
ar: افتح لوحة المدن
tr: Şehir panelini aç

# locationPermissionDenied
source: Location permission is denied. Please enable it from Settings.
ar: تم رفض إذن الموقع. فعّله من الإعدادات.
tr: Konum izni reddedildi. Lütfen ayarlardan aktif edin.

# gpsRefresh
source: Refresh GPS
ar: تحديث GPS
tr: Konumu yenile

# gpsRefreshing
source: Updating location...
ar: جارٍ تحديث الموقع...
tr: Konum güncelleniyor...

# emptyTrackedLocations
source: No tracked locations yet.
ar: لا توجد مواقع محفوظة بعد.
tr: Henüz kayıtlı konum yok.

# addressRequired
source: Address field cannot be empty.
ar: حقل العنوان لا يمكن أن يكون فارغًا.
tr: Adres alanı boş bırakılamaz.

# settingsLoadingMessage
source: Loading settings...
ar: جارٍ تحميل الإعدادات...
tr: Ayarlar yükleniyor...

# locationPermissionTitle
source: Location permission needed
ar: يلزم إذن الموقع
tr: Konum izni gerekli

# locationPermissionDeniedBody
source: We need access to your location or you can switch to manual city selection.
ar: يجب منح إذن الموقع أو اختيار المدينة يدويًا للحصول على أوقات الصلاة.
tr: Namaz vakitleri için konum erişimi vermeli ya da manuel şehir seçmelisiniz.

# locationPermissionPermanentBody
source: Location access is permanently denied. Please enable it in Settings or choose a city manually.
ar: تم رفض إذن الموقع بشكل دائم. فعّله من الإعدادات أو اختر مدينة يدويًا.
tr: Konum izni kalıcı olarak reddedildi. Lütfen ayarlardan izin verin veya manuel seçim yapın.

# locationUpdatedTitle
source: Location updated
ar: تم تحديث الموقع
tr: Konum güncellendi

# locationUpdatedBodyAuto
source: Your namaz times will refresh for the new GPS position.
ar: سيتم تحديث أوقات الصلاة حسب موقع GPS الجديد.
tr: Namaz vakitleri yeni GPS konumunuza göre güncellenecek.

# locationUpdatedBodyManual
source: Prayer times will refresh for {location}.
ar: سيتم تحديث أوقات الصلاة لـ {location}.
tr: {location} için namaz vakitleri güncellenecek.

# errorGenericTitle
source: Something went wrong
ar: حدث خطأ
tr: Bir hata oluştu

# locationFetchError
source: We could not refresh your position. Please try selecting a city manually.
ar: تعذّر تحديث الموقع. جرّب اختيار مدينة يدويًا.
tr: Konum yenilenemedi. Lütfen manuel şehir seçmeyi deneyin.

# locationSelectCityError
source: Please pick a city before updating the location.
ar: يُرجى اختيار مدينة قبل تحديث الموقع.
tr: Konumu güncellemeden önce bir şehir seçin.

# locationUpdateError
source: There was a problem while updating the manual location.
ar: حدث خطأ أثناء تحديث الموقع اليدوي.
tr: Manuel konum güncellenirken bir hata oluştu.

# notificationPermissionTitle
source: Notification permission
ar: إذن الإشعارات
tr: Bildirim izni

# notificationPermissionBody
source: Enable notifications to receive namaz reminders.
ar: فعّل الإشعارات لتلقي تذكيرات الصلاة.
tr: Namaz hatırlatmaları almak için bildirim iznini açın.

# languageChangeTitle
source: Language updated
ar: تم تحديث اللغة
tr: Dil güncellendi

# languageChangeDescription
source: Restart may be required for the full translation to apply.
ar: قد تحتاج إلى إعادة تشغيل التطبيق لتطبيق الترجمة بالكامل.
tr: Tam çeviri için uygulamayı yeniden başlatmanız gerekebilir.

# settingsResetDialogTitle
source: Reset settings
ar: إعادة تعيين الإعدادات
tr: Ayarları sıfırla

# settingsResetDialogBody
source: Are you sure you want to reset everything back to defaults?
ar: هل أنت متأكد من إعادة جميع الإعدادات إلى الوضع الافتراضي؟
tr: Tüm ayarları varsayılan değerlerine sıfırlamak istediğinize emin misiniz?

# settingsResetDialogConfirm
source: Reset
ar: إعادة
tr: Sıfırla

# settingsResetSuccessTitle
source: All set
ar: تم
tr: Tamamlandı

# settingsResetSuccessBody
source: Settings have been restored to their defaults.
ar: تمت إعادة الإعدادات إلى القيم الافتراضية.
tr: Ayarlar varsayılan değerlere döndürüldü.

# settingsResetError
source: An error occurred while resetting your settings.
ar: حدث خطأ أثناء إعادة الإعدادات.
tr: Ayarlar sıfırlanırken bir hata oluştu.

# dialogOk
source: OK
ar: حسنًا
tr: Tamam

# settingsLocationSection
source: Location
ar: الموقع
tr: Konum

# settingsNotificationsSection
source: Notifications
ar: الإشعارات
tr: Bildirimler

# settingsInterfaceSection
source: Interface
ar: الواجهة
tr: Arayüz

# settingsLocationMethodLabel
source: How should we detect your location?
ar: كيف تريد تحديد الموقع؟
tr: Konum nasıl belirlensin?

# settingsLocationMethodAuto
source: Automatic
ar: تلقائي
tr: Otomatik

# settingsLocationMethodManual
source: Manual
ar: يدوي
tr: Manuel

# settingsUpdateLocation
source: Update location
ar: تحديث الموقع
tr: Konumu güncelle

# settingsSelectCityPlaceholder
source: Select city
ar: اختر مدينة
tr: İl seçin

# settingsDistrictHint
source: District (optional)
ar: الحي (اختياري)
tr: İlçe (opsiyonel)

# settingsCurrentLocationLabel
source: Current location: {label}
ar: الموقع الحالي: {label}
tr: Mevcut konum: {label}

# settingsCurrentLocationGps
source: GPS coordinates
ar: إحداثيات GPS
tr: GPS Koordinatları

# settingsLatitudeLongitude
source: Lat: {lat}, Lon: {lon}
ar: خط العرض: {lat}، خط الطول: {lon}
tr: Enlem: {lat}, Boylam: {lon}

# settingsNotificationsToggle
source: Prayer notifications
ar: إشعارات أوقات الصلاة
tr: Namaz vakti bildirimleri

# settingsNotificationLeadTime
source: How early should reminders arrive?
ar: كم قبل الوقت تريد وصول التذكير؟
tr: Bildirimler ne kadar önce gelsin?

# settingsNotificationMinutesSuffix
source: minutes
ar: دقائق
tr: dakika

# settingsNotificationSound
source: Sound
ar: الصوت
tr: Bildirim sesi

# settingsNotificationVibration
source: Vibration
ar: الاهتزاز
tr: Bildirim titreşimi

# settingsShowArabicText
source: Show Arabic text
ar: عرض النص العربي
tr: Arapça metinleri göster

# settingsShowHijriDate
source: Show Hijri date
ar: عرض التاريخ الهجري
tr: Hicri tarihi göster

# settingsShowGregorianDate
source: Show Gregorian date
ar: عرض التاريخ الميلادي
tr: Miladi tarihi göster

# settingsResetButton
source: Reset all settings
ar: إعادة ضبط جميع الإعدادات
tr: Tüm ayarları sıfırla

# settingsAppVersionLabel
source: Vakit app v{version}
ar: تطبيق وقت الإصدار v{version}
tr: Namaz Vakti v{version}

# settingsAppCopyright
source: Â© 2025 All rights reserved
ar: © 2025 جميع الحقوق محفوظة
tr: © 2025 Tüm hakları saklıdır

# settingsCityPickerTitle
source: Select city
ar: اختر مدينة
tr: Şehir seçin

# settingsCitySearchHint
source: Search city...
ar: ابحث عن مدينة...
tr: Şehir ara...

# themePaletteTitle
source: Theme palette
ar: لوحة الألوان
tr: Tema Paleti

# themePaletteSubtitle
source: Choose the color family and softness that fits your eye.
ar: اختر عائلة الألوان ودرجة النعومة التي تناسبك.
tr: Hoşunuza giden renk ailesini ve yumuşaklık seviyesini seçin.

# themeSofteningLabel
source: Color softening
ar: تنعيم الألوان
tr: Renk Yumuşatma

# themeSofteningDescription
source: Soften the backgrounds for a brighter feel or keep it low for higher contrast.
ar: يمكنك تنعيم الخلفيات للحصول على مظهر أكثر إشراقًا أو تركها منخفضة لتباين أعلى.
tr: Arka plan tonlarını yumuşatarak daha parlak veya kontrastlı bir arayüz seçebilirsiniz.

# themePaletteOliveName
source: Olive Grove
ar: أخضر الزيتون
tr: Zeytin Yeşili

# themePaletteOliveDescription
source: Balanced greens with gentle gold accents.
ar: أخضر متوازن مع لمسات ذهبية هادئة.
tr: Klasik Vakit görünümü

# themePaletteDesertName
source: Desert Sunset
ar: غروب الصحراء
tr: Çöl Günbatımı

# themePaletteDesertDescription
source: Warm sand tones with amber highlights.
ar: درجات الرمال الدافئة مع أضواء كهرمانية.
tr: Sıcak kum ve amber tonları

# themePaletteMidnightName
source: Midnight Blue
ar: أزرق منتصف الليل
tr: Gece Mavisi

# themePaletteMidnightDescription
source: Cool night blues with moonlit accents.
ar: زرقة الليل الباردة مع لمسات ضوء القمر.
tr: Serin gece ve ay ışığı

# prayerImsak
source: Fajr
ar: الفجر
tr: İmsak

# prayerSunrise
source: Sunrise
ar: الشروق
tr: Güneş

# prayerDhuhr
source: Dhuhr
ar: الظهر
tr: Öğle

# prayerAsr
source: Asr
ar: العصر
tr: İkindi

# prayerMaghrib
source: Maghrib
ar: المغرب
tr: Akşam

# prayerIsha
source: Isha
ar: العشاء
tr: Yatsı

# prayerFajr
source: Fajr
ar: الفجر
tr: Sabah

source: Daily Prayers
ar: الصلوات اليومية
tr: Günlük Namazlar

source: Today's Date
ar: تاريخ اليوم
tr: Bugünün Tarihi

source: Today's Progress
ar: تقدم اليوم
tr: Bugünün İlerlemesi

# keepUpGoodWork
source: Keep up the good work!
ar: استمر في العمل الجيد!
tr: Böyle devam et!

source: Complete
ar: مكتمل
tr: Tamamlandı

source: COMPLETED
ar: مكتمل
tr: TAMAMLANDI

source: MISSED
ar: فائت
tr: KAÇIRILDI

source: PENDING
ar: قيد الانتظار
tr: BEKLİYOR

source: Done
ar: تم
tr: Kılındı

# missedPrayer
source: Missed
ar: فائت
tr: Kaçırıldı

source: remaining
ar: متبقي
tr: kaldı

source: Next prayer
ar: الصلاة القادمة
tr: Bir sonraki namaz

source: Qada Tracking
ar: تتبع القضاء
tr: Kaza Takibi

# qadaTrackingOn
source: Qada tracking enabled
ar: تتبع القضاء مفعل
tr: Kaza takibi açık

# qadaTrackingOff
source: Qada tracking disabled
ar: تتبع القضاء معطل
tr: Kaza takibi kapalı

# noPendingQada
source: Great! No pending qada prayers.
ar: رائع! لا توجد صلوات قضاء معلقة.
tr: Harika! Bekleyen kaza namazın yok.

# pendingQadaMessage
source: {count} prayers pending. Mark as you complete.
ar: {count} صلاة معلقة. ضع علامة عند الإكمال.
tr: {count} vakit bekliyor. Tamamladıkça işaretle.

source: Table
ar: جدول
tr: Tablo

source: Widget
ar: ودجت

source: Pending Qada Prayers
ar: صلوات القضاء المعلقة
tr: Bekleyen Kaza Namazları

# noRecordsYet
source: No pending records yet.
ar: لا توجد سجلات معلقة حتى الآن.
tr: Şu an bekleyen kayıt yok.

source: Date
ar: التاريخ
tr: Tarih

# prayerTime
source: Prayer
ar: الصلاة
tr: Vakit

source: Recorded
ar: مسجل
tr: Kaydedildi

# completedDate
source: Completed
ar: مكتمل
tr: Tamamlandı

source: Share CSV
ar: مشاركة CSV
tr: CSV paylaş

source: Copy to clipboard
ar: نسخ إلى الحافظة
tr: Panoya kopyala

# tableCopied
source: Table copied to clipboard
ar: تم نسخ الجدول إلى الحافظة
tr: Tablo panoya kopyalandı

# qadaTable
source: Qada prayer table
ar: جدول صلاة القضاء
tr: Kaza namazı tablosu

# currentQadaSummary
source: My current qada summary
ar: ملخص القضاء الحالي
tr: Güncel kaza namazı özetim

# editProfile
source: Edit
ar: تعديل
tr: Düzenle

# ageYears
source: years
ar: سنة
tr: yaş

# hijriAge
source: Hijri
ar: هجري
tr: Hicri

# profileSetupSubtitle
source: Add your personal preferences, track qada and extra prayers.
ar: أضف تفضيلاتك الشخصية، تتبع صلاة القضاء والنوافل.
tr: Kişisel tercihlerini ekle, kaza ve nafile ibadetlerini takip et.

# profileName
source: Name
ar: الاسم
tr: İsim

# profileNameRequired
source: Please enter your name
ar: الرجاء إدخال اسمك
tr: Lütfen adını yaz

# profileNameMinLength
source: Name must be at least 2 characters
ar: يجب أن يكون الاسم حرفين على الأقل
tr: İsim en az 2 karakter olmalı

# profileBirthDate
source: Birth Date
ar: تاريخ الميلاد
tr: Doğum Tarihi

# profileBirthDateHelp
source: Select Your Birth Date
ar: اختر تاريخ ميلادك
tr: Doğum Tarihinizi Seçin

# profileSelectDate
source: Select date
ar: اختر التاريخ
tr: Tarih seçin

# profileBirthDateRequired
source: Please select your birth date
ar: الرجاء اختيار تاريخ ميلادك
tr: Lütfen doğum tarihinizi seçin

# profileGender
source: Gender
ar: الجنس
tr: Cinsiyet

# profileGenderMale
source: Male
ar: ذكر
tr: Erkek

# profileGenderFemale
source: Female
ar: أنثى
tr: Kadın

# profileGenderUnspecified
source: Prefer not to say
ar: أفضل عدم الإفصاح
tr: Belirtmek istemiyorum

# qadaTrackingSubtitle
source: Automatically record missed prayers.
ar: سجل الصلوات الفائتة تلقائياً.
tr: Kaçırdığın vakitleri otomatik kaydedelim.

# extraPrayerNotifications
source: Extra Prayer Reminders
ar: تذكيرات النوافل
tr: Nafile Hatırlatmaları

# extraPrayerNotificationsSubtitle
source: Get notifications for Duha, Ishraq and others.
ar: احصل على إشعارات للضحى والإشراق وغيرها.
tr: Duha, İşrak ve diğerlerini bildirim olarak al.

# profileStart
source: Start
ar: ابدأ
tr: Başla

# profileSetupTitle
source: Start Prayer Tracking
ar: ابدأ تتبع الصلاة
tr: Namaz Takibini Başlat

# profileUpdate
source: Update Profile
ar: تحديث الملف الشخصي
tr: Profilini Güncelle

source: Extra Prayers
ar: صلوات إضافية
tr: Ekstra İbadetler

# prayerDuha
source: Duha (Forenoon)
ar: الضحى
tr: Duha (Kuşluk)

# prayerIshraq
source: Ishraq
ar: الإشراق
tr: İşrak

# prayerTahajjud
source: Tahajjud
ar: التهجد
tr: Teheccüd

# prayerAwwabin
source: Awwabin
ar: الأوابين
tr: Evvabin

# prayerDuhaDesc
source: 20 minutes after sunrise
ar: بعد 20 دقيقة من شروق الشمس
tr: Güneş doğduktan sonra 20 dakika içinde

# prayerIshraqDesc
source: 15 minutes after sunrise
ar: بعد 15 دقيقة من شروق الشمس
tr: Güneş doğduktan 15 dakika içinde

# prayerTahajjudDesc
source: From midnight to dawn
ar: من منتصف الليل إلى الفجر
tr: Gece yarısından seher vaktine kadar

# prayerAwwabinDesc
source: Between Maghrib and Isha
ar: بين المغرب والعشاء
tr: Akşam ile yatsı arası sessiz vakit
